{
  "AZATHIOPRINE": {
    "primary_gene": "TPMT",
    "phenotype_rules": {
      "IM": {
        "risk_label": "Adjust Dosage",
        "severity": "moderate",
        "recommendation": "Intermediate TPMT activity. Reduce azathioprine starting dose by 30-70% of normal dose. Increased risk of myelosuppression. Monitor CBC more frequently."
      },
      "PM": {
        "risk_label": "Toxic",
        "severity": "critical",
        "recommendation": "Absent TPMT activity. Drastically reduce azathioprine dose (reduce to 10% of standard) or avoid entirely. Life-threatening myelosuppression risk. Consider alternative immunosuppressant."
      },
      "NM": {
        "risk_label": "Safe",
        "severity": "none",
        "recommendation": "Normal TPMT activity. Use azathioprine per standard dosing. Monitor blood counts as per standard practice."
      }
    }
  },
  "FLUOROURACIL": {
    "primary_gene": "DPYD",
    "phenotype_rules": {
      "PM": {
        "risk_label": "Toxic",
        "severity": "critical",
        "recommendation": "Absent or near-absent DPD activity. Administration of fluoropyrimidines is contraindicated. Life-threatening toxicity risk including fatal neutropenia, mucositis, and sepsis. Consider other therapeutic options."
      },
      "IM": {
        "risk_label": "Adjust Dosage",
        "severity": "moderate",
        "recommendation": "Decreased DPD activity (30-70%). Reduce fluorouracil dose by 25-50%. Increased risk for severe drug toxicity (mucositis, neutropenia, hand-foot syndrome). Monitor closely and increase dose in later cycles if no toxicity is observed."
      },
      "NM": {
        "risk_label": "Safe",
        "severity": "none",
        "recommendation": "Normal DPD activity. No indication to change dose or therapy. Use label-recommended dosage and administration."
      }
    }
  },

  "CLOPIDOGREL": {
    "primary_gene": "CYP2C19",
    "phenotype_rules": {
      "PM": {
        "risk_label": "Ineffective",
        "severity": "high",
        "recommendation": "Avoid clopidogrel. CYP2C19 poor metabolizers have significantly reduced active metabolite formation, increased on-treatment platelet reactivity, and increased risk for adverse cardiac and cerebrovascular events. Use prasugrel or ticagrelor instead."
      },
      "IM": {
        "risk_label": "Adjust Dosage",
        "severity": "moderate",
        "recommendation": "Reduced clopidogrel activation due to CYP2C19 intermediate metabolizer status. Consider alternative antiplatelet therapy (prasugrel, ticagrelor) if no contraindication, or consider increased clopidogrel dose with platelet function testing."
      },
      "RM": {
        "risk_label": "Safe",
        "severity": "none",
        "recommendation": "CYP2C19 rapid metabolizer. Adequate clopidogrel activation expected. Use standard dose (75 mg/day)."
      },
      "NM": {
        "risk_label": "Safe",
        "severity": "none",
        "recommendation": "CYP2C19 normal metabolizer. Normal clopidogrel active metabolite formation and on-treatment platelet reactivity. Use standard dose (75 mg/day)."
      },
      "URM": {
        "risk_label": "Safe",
        "severity": "none",
        "recommendation": "CYP2C19 ultrarapid metabolizer. Enhanced activation of clopidogrel. Standard dosing appropriate. May have slightly increased bleeding risk."
      }
    }
  },
  "CODEINE": {
    "primary_gene": "CYP2D6",
    "phenotype_rules": {
      "PM": {
        "risk_label": "Ineffective",
        "severity": "high",
        "recommendation": "Avoid codeine. CYP2D6 poor metabolizers have greatly reduced morphine formation leading to diminished analgesia. If opioid use is warranted, consider a non-tramadol opioid."
      },
      "IM": {
        "risk_label": "Ineffective",
        "severity": "high",
        "recommendation": "Codeine may have reduced efficacy due to decreased morphine formation. Use label-recommended starting dose but monitor closely for inadequate pain relief. Consider alternative analgesic if warranted."
      },
      "RM": {
        "risk_label": "Adjust Dosage",
        "severity": "moderate",
        "recommendation": "CYP2D6 rapid metabolizer. Increased formation of morphine possible. Use codeine with caution at lowest effective dose. Monitor for adverse effects."
      },
      "NM": {
        "risk_label": "Safe",
        "severity": "none",
        "recommendation": "CYP2D6 normal metabolizer. Codeine can be used per standard of care. Use label-recommended dosing."
      },
      "URM": {
        "risk_label": "Toxic",
        "severity": "critical",
        "recommendation": "Avoid codeine. CYP2D6 ultrarapid metabolizers convert codeine to morphine at greatly increased rates, risking fatal respiratory depression. Use non-opioid analgesic."
      }
    }
  },
  "SIMVASTATIN": {
    "primary_gene": "SLCO1B1",
    "phenotype_rules": {
      "IM": {
        "risk_label": "Adjust Dosage",
        "severity": "moderate",
        "recommendation": "Decreased SLCO1B1 transporter function. Increased simvastatin systemic exposure. Use lower simvastatin dose (max 20mg) or consider alternative statin (rosuvastatin, pravastatin). Monitor for myopathy symptoms."
      },
      "NM": {
        "risk_label": "Safe",
        "severity": "none",
        "recommendation": "Normal SLCO1B1 function. Typical myopathy risk and statin exposure. Prescribe desired starting dose and adjust based on disease-specific guidelines."
      },
      "PM": {
        "risk_label": "Toxic",
        "severity": "critical",
        "recommendation": "Poor SLCO1B1 function. High risk of simvastatin-induced myopathy and rhabdomyolysis. Avoid simvastatin or use lowest dose. Prescribe alternative statin (rosuvastatin, pravastatin) instead."
      }
    }
  },
  "WARFARIN": {
    "primary_gene": "CYP2C9",
    "phenotype_rules": {
      "IM": {
        "risk_label": "Adjust Dosage",
        "severity": "moderate",
        "recommendation": "Reduced warfarin clearance due to CYP2C9 decreased function. Reduce initial dose by 25-50%. Higher risk of supratherapeutic INR and major bleeding. More frequent INR monitoring required during dose stabilization."
      },
      "NM": {
        "risk_label": "Safe",
        "severity": "none",
        "recommendation": "Normal CYP2C9 metabolism. Use warfarin with standard dosing algorithm. Adjust dose based on INR monitoring per standard of care."
      },
      "PM": {
        "risk_label": "Toxic",
        "severity": "critical",
        "recommendation": "Significantly reduced warfarin metabolism. Reduce initial dose by 50-80%. High risk of supratherapeutic INR and major bleeding. Consider alternative anticoagulant or very low starting dose with intensive INR monitoring."
      }
    }
  }
}